/* Создать консольное приложение, удовлетворяющее следующим требованиям:  
•	Приложение должно быть объектно-, а не процедурно-ориентированным.  
•	Каждый класс должен иметь отражающее смысл название и информативный состав.  
•	Наследование должно применяться только тогда, когда это имеет смысл.  
•	При кодировании должны быть использованы соглашения об оформлении кода java code convention.  
•	Классы должны быть грамотно разложены по пакетам.  
•	Консольное меню должно быть минимальным.  
•	Для хранения данных можно использовать файлы. 
 
* Дракон и его сокровища. 
* Создать программу, позволяющую обрабатывать сведения о 100 сокровищах в пещере дракона. 
* Реализовать возможность просмотра сокровищ, выбора самого дорогого по стоимости сокровища и выбора сокровищ на заданную сумму.
* 
* Правила:
* - Игра представляет собой фигурку дракона, который охраняет свои сокровища-монетки.
* - Игроки по очереди бросают кости и делают ход: выпавшее число показывает, сколько раз нужно потянуть за язык дракона.
* - Если дракон не проснется, вы можете взять одну из его монет.
* - Если дракон просыпается, он хватает игрока за руку. Это значит, что монету нужно вернуть.
* - Побеждает игрок, набравший большее количество монет.
*/

package by.koroza.basics_oop.numberfour.main;

public class Main {

	public static void main(String[] args) {

	}
}